[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
い
の
な
、
て
に
た
る
か
は
が
と
し
っ
う
を
で
ら
だ
も
れ
こ
」
ん
「
く
そ
あ
す
ま
り
よ
け
私
き
ち
ど
え
さ
わ
ゃ
ろ
つ
人
ン
？
ー
じ
…
ラ
や
一
分
お
見
リ
め
出
フ
ね
言
魔
何
間
気
来
せ
ず
み
手
上
中
ア
ば
本
思
力
方
自
目
感
女
少
ッ
大
今
前
ル
ス
レ
日
体
カ
外
変
色
ほ
理
ク
生
入
部
へ
ょ
向
聞
知
後
物
げ
ト
動
行
話
屋
時
様
界
ナ
─
イ
全
ド
場
無
夢
立
館
持
身
意
々
的
通
世
合
《
》
二
チ
開
べ
下
パ
事
び
ぐ
取
―
歩
書
所
ュ
霊
空
地
術
子
足
当
考
想
心
む
最
ミ
度
込
夜
紅
者
！
着
近
回
音
会
能
面
情
タ
異
違
声
髪
実
男
メ
プ
口
小
消
先
づ
明
不
ぎ
神
切
性
食
内
同
誰
現
起
ぶ
ベ
確
背
別
正
血
光
顔
ご
長
咲
吸
道
ゆ
直
兄
テ
幻
強
彼
名
悪
使
黒
結
対
発
高
ジ
置
戻
関
過
数
早
沙
ふ
付
終
覚
残
周
落
相
店
飛
頭
図
仕
解
返
風
始
味
流
多
郷
用
.
問
キ
続
視
広
シ
白
普
金
次
赤
識
ロ
・
紫
振
要
遠
他
以
扉
宴
鬼
離
火
常
特
町
止
法
初
ひ
妖
服
化
文
主
元
反
呑
姉
進
石
十
コ
必
藍
作
然
ボ
新
華
達
表
囲
決
定
マ
三
ぜ
重
丈
命
社
去
差
掛
バ
ぱ
庵
呼
待
段
妹
突
葉
帰
降
閉
夫
歎
木
薄
夕
座
森
犯
在
ざ
鈴
集
指
抜
報
家
量
形
怪
触
ィ
瞬
存
記
天
ペ
応
由
予
読
倒
可
戦
成
ガ
笑
ぼ
番
態
息
欲
愛
状
良
抱
サ
死
引
麗
探
片
紙
逃
真
暗
程
寝
』
配
浮
端
横
好
ャ
静
完
眠
美
姿
オ
具
押
僕
線
失
語
機
満
連
構
首
ぞ
ツ
走
答
品
張
安
奥
『
認
グ
散
信
建
鞄
運
謙
半
撃
ギ
冷
係
雨
博
霖
限
月
質
放
調
影
君
勝
接
ハ
活
階
助
深
エ
点
左
追
瞳
居
側
稲
受
際
題
教
ぁ
握
棚
両
太
ム
転
机
説
四
響
得
ワ
陽
門
並
勢
窓
ブ
乗
ェ
緒
隠
昔
昨
移
車
腕
ニ
途
水
収
器
ぬ
七
備
山
伸
格
果
ネ
右
壁
里
堂
破
細
黄
素
加
員
ケ
為
単
住
料
遅
ピ
危
望
俺
経
有
越
注
再
頃
学
巫
敷
増
ヒ
ノ
闘
急
装
精
非
ビ
隣
届
ソ
ホ
寄
伝
奪
害
狼
渡
ウ
茶
壊
羽
代
嫌
憶
ァ
e
飲
軽
楽
香
告
念
ダ
払
打
区
奴
ズ
雲
導
字
国
到
腰
燃
o
年
局
割
胸
炎
極
互
隙
計
ポ
期
容
絶
客
平
断
踏
耳
許
柱
役
疲
警
幸
設
五
跡
混
染
位
交
箱
制
負
恐
剣
件
セ
輝
宝
s
団
保
デ
幕
似
（
）
巨
朝
辺
怒
末
基
駄
未
根
逆
険
供
丶
吹
星
撫
避
登
余
路
尊
低
l
怖
殺
ョ
焼
況
鎖
陣
底
休
(
痛
景
)
モ
掴
治
腹
叩
被
業
替
困
退
義
師
買
準
熱
像
遊
球
和
例
象
独
種
狭
裏
展
条
描
減
短
参
類
罪
沫
央
弾
疑
鳴
属
簡
肩
虚
隔
興
更
埋
距
ぽ
抗
椅
崩
ヴ
律
忘
源
屈
既
射
己
賢
富
幼
～
眼
黙
抵
酷
比
詳
沼
仙
布
示
肉
覆
留
昇
詰
妙
我
包
泡
電
速
苦
廊
折
密
査
迷
縛
緑
野
揺
練
微
敵
捨
八
青
換
習
施
r
温
尽
弱
懐
眺
案
銀
固
優
組
傷
棒
境
純
澄
０
画
床
了
労
ゴ
六
順
九
古
之
草
証
沈
寂
把
積
難
鳥
室
材
縮
等
闇
創
送
拠
溢
支
裂
V
絡
議
角
願
筋
式
系
穴
枚
操
u
永
乱
処
井
験
原
徐
約
値
戒
複
束
宿
価
商
御
暴
悲
介
鮮
号
滅
刻
午
ゅ
洋
猫
揃
層
照
丁
帯
利
花
族
衝
従
民
迎
洞
宙
漏
綺
昼
絵
舞
整
土
投
邪
仲
改
欠
汚
焦
荒
抑
盗
璃
憂
模
札
奇
守
第
駆
飾
万
秒
唱
縁
晴
攻
訳
察
甘
透
秘
冊
久
監
究
貴
鍵
席
暇
凝
頬
頑
脳
陰
淡
士
観
鈍
範
判
規
親
迫
選
珠
巻
橙
丸
吐
環
慣
〈
〉
超
傘
厚
呪
舌
巡
快
ヤ
液
働
復
拾
頼
嬢
荷
共
礼
遭
志
輪
激
紹
惑
工
玉
喰
怠
畑
箒
任
柔
曇
脱
旅
善
珍
恥
庭
効
筆
納
革
塗
捕
検
技
職
給
暮
ザ
塊
済
膨
誘
扱
求
袋
枝
肌
鬱
孤
槍
樹
繰
叫
談
傾
都
催
奏
飽
蝙
蝠
葵
I
２
覗
ぇ
板
k
b
骨
震
剥
遥
,
銃
醜
慢
詮
悔
百
玄
倍
ォ
則
含
繋
仮
院
蹴
喜
t
酒
牙
惰
５
講
ぃ
嘘
園
１
廃
湿
因
与
祝
敗
研
育
圧
*
略
柄
砕
菓
狙
補
希
雑
露
鋭
型
紛
権
驚
濃
群
旦
林
h
慧
粋
公
４
釣
悟
管
獲
墟
暑
汗
障
論
煙
狂
防
毎
円
颯
務
台
刺
造
衣
曲
産
預
校
費
街
ゼ
弁
田
稼
試
眷
挿
幽
霧
崖
灯
除
如
嬉
詠
杯
喧
掌
a
拳
伏
護
挟
魅
騒
針
締
適
裕
馬
便
及
資
若
印
塞
海
雁
捜
薬
魂
註
弔
頁
載
毛
膝
湯
嘩
恋
謝
否
聴
編
尻
仰
歳
溶
索
襲
財
裁
誤
申
挙
拓
救
匂
頂
翼
y
唇
武
･
９
呟
臭
晩
飯
脈
製
捲
ぉ
矢
辛
泥
徴
辿
概
筒
才
較
肢
貸
i
努
雪
/
漂
D
狗
拡
購
看
ぺ
Ａ
溜
諦
獣
灰
寒
儀
担
勘
ゾ
省
庁
病
跳
禁
遇
威
潜
鹿
干
統
般
喋
削
売
至
偶
幾
T
盛
庫
個
胴
匹
刀
竹
惜
額
眩
湧
虹
Ｓ
〝
〟
専
滑
靴
浸
侵
弟
彩
僅
硬
映
易
匠
協
伴
躍
村
皆
脇
句
慮
亡
緩
称
東
提
捉
西
S
油
皮
川
軋
封
擦
憎
賑
錯
蒼
窟
O
g
P
苗
斜
傲
欄
鼻
坊
鏡
派
８
噂
錆
曖
昧
策
殿
寧
挨
拶
濡
鼓
暖
誇
築
畳
唯
幅
粉
虐
憩
噛
恵
叶
熟
釈
級
矛
隅
雰
俯
穏
逸
爆
ぅ
還
獄
項
沢
拭
呂
扇
悩
ｒ
南
招
添
濁
宅
Ｎ
友
借
洗
銭
夏
波
帳
誕
ユ
写
癖
令
膚
鉄
織
症
冗
鍛
睡
拘
貧
停
率
営
盾
択
凡
鑑
標
潰
栄
執
靄
顎
忍
卓
F
揚
帽
朱
架
祓
ゔ
凶
茸
岩
肴
楼
各
翔
没
咆
哮
貫
又
稗
伺
ヘ
課
３
1
璧
慎
戸
湖
拝
兼
充
責
娘
這
舐
涙
枠
蔽
堅
礎
臆
姓
肝
毒
析
災
肯
喉
虫
蓋
測
泊
滞
市
刷
豪
馴
雀
損
舎
偽
褒
凄
拐
耐
滲
杞
列
老
功
d
評
閃
G
授
奮
飼
福
契
却
徒
裸
滴
賽
尋
憤
ぷ
節
埃
録
沿
章
辞
歪
養
麓
渇
ヶ
縦
坦
錠
域
偏
痕
訪
渉
趣
箇
駐
衆
副
厳
姫
倉
愚
掃
杖
父
循
推
履
歓
Ｉ
飢
春
ゲ
候
捧
膣
植
垣
癒
佇
雫
括
童
維
斎
符
仏
奈
歯
垂
枕
雇
妄
駅
峙
臓
朧
歌
浴
房
依
潔
故
絞
漢
歴
将
哀
苛
幹
閑
控
算
児
遮
排
襟
延
匿
賛
窮
兵
稿
L
爺
晒
殊
痩
兎
呆
寿
聖
科
絨
毯
遣
郭
ヨ
贅
憧
健
淫
寸
嘲
惨
療
羅
枯
溺
茜
忠
双
砂
城
痺
Ｂ
醒
官
６
茂
萌
躓
拍
盆
掘
C
随
審
惚
腔
潤
腐
帝
繍
賊
総
塵
瓶
阻
史
演
胃
飴
跪
企
領
裾
嗜
械
刃
即
犠
牲
是
耶
瞼
乏
遂
緊
耗
齢
承
弊
兆
劣
斉
陶
囚
司
頻
争
俗
綿
儚
ぴ
敢
疎
糧
箋
塔
脅
葦
韻
糸
縫
臥
蔦
堕
尖
援
忌
薙
亭
臨
棄
倦
委
喚
融
來
償
清
魑
魍
魎
菜
蓮
寺
踪
紡
贄
緯
酔
怯
殻
尾
煤
枢
琳
衛
爪
陳
採
壇
刑
佐
誠
谷
磨
忙
穢
麻
0
Ｈ
曜
魚
皺
芸
蔓
悶
○
罰
淹
携
畜
零
纂
薔
薇
咳
典
潮
紳
唾
掻
豆
嗚
頷
磁
滓
脂
遺
祈
慨
爽
就
涼
躊
躇
季
妻
掲
王
焚
旧
婚
柵
貨
晶
渋
貼
併
千
政
昏
舗
籠
北
隊
浪
漁
謎
辣
致
践
網
吊
萎
咀
嚼
厄
眉
乾
殴
旺
酸
慌
軸
痴
羨
勉
益
蓄
河
錬
愉
凛
躯
邂
逅
些
袖
粒
垢
爛
諸
宗
刊
喩
沌
乳
股
蠢
週
卒
捏
尚
惹
餓
瞰
修
訴
藤
詛
劇
江
傍
淀
島
懲
掬
吠
詭
〜
2
【
】
７
喫
狩
庇
慰
馳
述
漫
睦
妥
Ｐ
啜
甲
悦
囁
弄
喘
ｎ
漠
謀
嶷
Ｖ
岸
瓦
礫
撤
勤
咄
嗟
紋
稀
邸
粗
衰
坂
桁
宇
党
宣
赦
煽
母
賤
奢
砲
悠
府
宛
偉
遜
挑
覧
哲
骸
烈
逝
堪
敬
檻
晃
H
v
w
勇
軟
占
騎
燥
M
肥
氷
戯
N
Ｃ
繁
諾
桃
隷
競
脚
竿
揉
曹
鱗
毅
渦
黝
逢
躁
斬
旋
彷
彿
圏
漸
昂
閻
瀕
緻
荘
朗
抽
豊
禅
焉
蒐
灼
騙
紆
芽
憊
穫
塀
魄
剪
蛇
鼠
嫉
妬
箔
咎
n
W
召
熊
戟
覇
坏
茨
鎮
猛
恒
咥
畏
嵌
唐
嵐
紐
瞭
詞
遵
京
蒔
坤
跋
扈
葛
涅
槃
膜
哄
弓
芒
秩
序
綻
詫
甚
囮
据
泣
壮
栞
捗
奔
芻
鍬
簾
曰
肘
須
孕
唸
智
秋
鴉
郵
禿
牽
董
偵
閥
継
刹
那
襖
阿
賭
津
妨
蕎
麦
犬
凍
屁
芯
％
征
＿
朽
誂
倫
其
壱
6
遍
ｍ
ｙ
ｐ
ｃ
≪
≫
鋼
辻
褄
募
腋
桶
蝉
朦
ⅰ
棲
拒
緋
瀟
洒
纏
耽
狸
唆
＆
恍
餅
鞘
雷
擁
讐
貌
鉛
喪
辱
腸
煮
沸
燦
煌
罵
徹
冴
薪
乙
淑
稽
脛
轢
睨
籍
漆
豹
摘
擲
請
揮
陸
楕
軍
掟
蛮
討
蒸
披
貶
訂
綱
促
ぢ
需
瞑
Ｏ
Ｅ
槌
ヌ
迅
往
郎
貰
肺
溝
岐
軌
娯
剤
糖
繊
泳
閲
胆
撮
県
冒
釘
貪
遡
熾
B
享
氏
冬
懸
祖
暦
販
億
劫
弧
湛
禊
准
乖
患
啓
搬
愁
丹
汁
茎
船
擬
銘
版
廉
J
袈
裟
□
艶
醸
徳
肪
尿
泌
晦
捻
p
j
c
媚
誉
侍
狐
髷
炭
顧
硯
嗅
譲
噴
贖
冥
屠
陥
牢
勧
旨
彙
疾
摩
批
厭
噎
踊
刈
陪
廷
迂
ゥ
辟
貞
憲
葬
仄
粘
浅
蜜
康
涸
農
霞
棘
謡
繕
哭
蛾
繭
儘
卑
褪
枷
煩
蝕
