[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
い
の
な
、
て
に
た
か
る
は
が
と
し
っ
う
を
で
ら
だ
も
れ
こ
ん
く
そ
あ
す
ま
り
よ
け
私
き
ち
ど
え
さ
わ
ゃ
ろ
つ
ン
人
？
…
ー
じ
ラ
や
お
一
分
リ
め
見
フ
出
ね
言
何
魔
間
せ
気
来
ず
み
手
上
ア
中
ば
本
思
力
自
方
目
感
ッ
女
少
大
今
前
ル
ス
カ
レ
日
体
外
変
色
ほ
理
ク
生
へ
入
部
ょ
向
知
聞
ト
げ
後
動
物
様
行
話
時
屋
界
─
ナ
イ
全
無
ド
場
夢
立
館
々
持
身
的
意
通
世
合
チ
二
《
》
開
パ
べ
下
ぐ
事
歩
び
―
書
取
所
ュ
霊
地
空
術
子
足
当
想
考
心
む
最
ミ
込
夜
！
度
者
紅
着
回
近
違
音
会
能
情
タ
面
異
声
実
髪
男
メ
プ
口
小
消
先
ぎ
明
づ
不
神
切
性
食
内
同
誰
現
起
兄
ぶ
確
ベ
背
別
正
光
血
長
顔
ご
咲
吸
悪
道
ふ
ゆ
直
強
幻
名
テ
黒
彼
発
使
結
ジ
対
高
置
過
戻
関
早
数
沙
付
残
終
覚
周
落
図
解
相
店
飛
頭
仕
風
流
返
始
味
多
郷
用
コ
キ
問
続
視
.
広
・
普
シ
紫
白
金
次
赤
識
扉
ロ
振
以
要
遠
他
宴
鬼
離
火
文
常
止
ひ
法
特
町
初
妖
服
主
化
然
石
決
元
反
呑
姉
進
十
重
必
藍
作
定
ボ
新
華
達
表
囲
ぜ
マ
バ
丈
社
三
命
去
差
掛
ぱ
庵
呼
突
待
段
妹
葉
帰
夫
降
閉
歎
木
薄
夕
犯
座
森
在
ざ
鈴
集
指
抜
ィ
量
報
触
家
形
怪
記
瞬
存
息
天
ガ
戦
可
ペ
応
成
由
予
笑
態
読
倒
良
ぼ
番
愛
欲
逃
静
状
抱
眠
暗
麗
サ
死
引
真
探
片
寝
紙
程
ャ
配
失
張
浮
端
横
好
完
美
姿
答
オ
具
押
僕
線
語
機
満
ハ
連
ぞ
構
首
安
ツ
散
走
品
奥
認
グ
信
冷
建
半
鞄
運
謙
霖
ギ
撃
博
係
雨
限
月
君
質
勝
放
接
調
影
活
階
助
深
ぁ
追
エ
点
左
瞳
題
居
側
稲
受
際
響
教
握
机
棚
両
太
ム
転
説
四
得
ワ
陽
門
並
勢
窓
ブ
乗
ェ
腕
緒
隠
昔
ぬ
昨
移
車
器
ニ
途
水
越
収
望
七
備
黄
山
伸
破
格
果
ネ
右
壁
料
里
堂
細
素
加
ピ
員
ケ
遅
為
単
住
俺
危
経
増
有
注
再
頃
学
巫
敷
ホ
闘
ヒ
ァ
ノ
届
急
装
精
非
ビ
隣
ウ
ソ
寄
伝
奪
害
狼
渡
念
茶
嫌
軽
壊
香
羽
代
憶
打
e
雲
飲
楽
燃
告
ダ
払
区
炎
熱
奴
ズ
年
導
字
絶
客
国
到
腰
踏
期
o
局
割
胸
極
互
隙
計
ポ
疲
容
避
平
断
耳
許
柱
役
朝
警
幸
設
五
駄
制
跡
混
染
位
交
箱
負
恐
剣
件
セ
輝
星
宝
s
団
保
像
デ
幕
似
（
）
巨
尊
辺
怒
末
基
未
根
逆
焼
険
供
丶
吹
困
撫
登
独
余
路
低
l
怖
殺
叩
ョ
律
況
鎖
陣
底
休
(
)
痛
退
景
モ
掴
治
腹
義
被
業
替
～
師
狭
買
準
遊
球
短
和
例
象
種
沫
裏
展
条
描
減
参
鳴
類
罪
賢
央
ぽ
弾
疑
属
我
簡
肩
虚
隔
興
温
更
埋
距
黙
抗
椅
崩
酷
ヴ
苦
忘
源
屈
既
射
己
富
幼
眼
抵
比
詳
泡
沼
仙
寂
布
八
示
肉
覆
留
昇
詰
妙
包
密
電
野
敵
速
青
固
廊
折
ゴ
査
迷
縛
緑
揺
練
微
捨
換
了
習
労
優
施
r
草
尽
弱
懐
眺
案
銀
組
傷
創
棒
境
純
沈
澄
０
画
床
六
順
九
古
之
証
把
積
難
鳥
室
材
縮
等
悲
闇
ゅ
送
拠
溢
支
裂
V
超
絡
約
議
猫
角
願
筋
式
系
穴
枚
操
u
永
乱
処
井
験
原
徐
値
戒
利
複
束
宿
価
商
御
暴
介
鮮
号
滅
刻
午
洋
揃
層
照
丁
帯
花
族
衝
従
民
惑
迎
洞
宙
漏
綺
昼
絵
舞
整
土
投
邪
仲
改
欠
汚
焦
荒
抑
盗
璃
憂
模
札
奇
守
第
珠
巻
駆
飾
万
秒
脱
唱
縁
晴
攻
訳
察
甘
透
秘
冊
久
監
究
貴
鍵
親
席
暇
凝
頬
頑
脳
陰
淡
士
観
鈍
快
範
判
規
礼
迫
選
橙
丸
吐
環
曇
慣
〈
〉
傘
厚
呪
舌
巡
ヤ
液
働
復
拾
頼
嬢
荷
共
談
遭
志
輪
激
紹
工
玉
喰
怠
畑
箒
任
柔
旅
善
珍
恥
庭
効
筆
納
革
塗
捕
検
技
職
給
暮
ザ
/
塊
済
２
膨
誘
扱
求
袋
枝
肌
鬱
孤
悔
槍
樹
繰
圧
叫
傾
都
催
奏
群
飽
蝙
蝠
拡
葵
I
５
覗
ぇ
板
k
b
１
骨
廃
震
剥
遥
,
造
銃
醜
慢
詮
百
玄
倍
ォ
則
含
繋
仮
院
蹴
喜
t
酒
牙
惰
講
ぃ
嘘
園
４
湿
暑
因
伏
毎
与
祝
敗
研
育
*
略
柄
砕
菓
狙
補
希
雑
露
鋭
型
紛
権
田
驚
濃
旦
林
h
慧
粋
公
釣
悟
管
獲
墟
汗
障
論
煙
狂
防
円
颯
務
台
刺
衣
曲
産
預
校
費
街
裁
海
ゼ
弁
稼
試
眷
挿
幽
霧
崖
眩
灯
除
如
嬉
詠
杯
喧
掌
捲
a
拳
編
護
挟
魅
騒
針
締
適
裕
馬
便
及
資
若
印
財
塞
雁
捜
薬
魂
註
弔
頁
載
呟
毛
膝
湯
嘩
恋
謝
否
聴
辛
尻
仰
歳
溶
索
跳
襲
誤
申
挙
拓
救
匂
頂
翼
y
唇
武
･
９
臭
晩
飯
脈
製
ぉ
矢
泥
徴
辿
躍
概
筒
才
較
肢
貸
i
努
雪
漂
D
狗
購
看
ぺ
Ａ
溜
諦
獣
灰
寒
儀
担
勘
ゾ
暖
省
庁
病
唯
禁
遇
威
潜
鹿
干
統
般
喋
削
売
至
爆
偶
幾
T
盛
ぅ
庫
個
胴
匹
刀
竹
惜
額
坊
湧
虹
Ｓ
〝
〟
専
滑
靴
浸
侵
弟
彩
僅
硬
映
易
匠
協
姓
伴
冗
村
皆
脇
句
慮
亡
緩
称
東
提
捉
西
S
油
皮
川
軋
封
擦
憎
賑
錯
蒼
窟
O
g
P
苗
斜
傲
欄
添
鼻
鏡
派
８
噂
錆
曖
昧
策
殿
寧
挨
拶
濡
鼓
誇
築
畳
毒
幅
粉
虐
憩
噛
恵
叶
熟
釈
級
矛
隅
雰
俯
穏
逸
栄
還
獄
項
F
沢
拭
呂
扇
悩
ｒ
南
３
招
濁
宅
Ｎ
友
借
洗
褒
銭
夏
波
帳
誕
ユ
写
癖
令
膚
鉄
織
症
鍛
睡
拘
貧
停
率
営
盾
択
凡
鑑
標
潰
執
滲
靄
顎
功
忍
卓
揚
帽
朱
架
祓
ゔ
凶
茸
岩
肴
楼
各
翔
没
咆
哮
貫
又
稗
伺
ヘ
課
1
璧
慎
戸
湖
拝
兼
充
責
娘
這
舐
涙
枠
蔽
堅
礎
臆
肝
析
災
肯
喉
虫
蓋
測
泊
滞
市
刷
豪
馴
雀
損
舎
偽
凄
拐
耐
杞
列
老
d
評
閃
G
授
奮
飼
福
契
却
徒
裸
滴
賽
尋
憤
ぷ
節
埃
録
沿
章
辞
歪
養
麓
渇
ヶ
縦
坦
錠
域
偏
痕
訪
渉
趣
箇
駐
衆
副
厳
姫
倉
愚
掃
杖
父
ヨ
循
推
履
歓
Ｉ
飢
春
ゲ
候
捧
膣
植
垣
癒
佇
雫
括
童
維
斎
符
仏
奈
歯
垂
枕
雇
妄
６
駅
峙
臓
朧
歌
浴
頷
房
依
潔
故
絞
漢
歴
将
飴
哀
苛
幹
閑
控
算
児
遮
排
襟
延
匿
賛
窮
兵
稿
L
爺
晒
殊
痩
兎
呆
寿
聖
科
絨
毯
遣
郭
贅
憧
健
淫
寸
嘲
惨
療
羅
枯
溺
茜
忠
双
砂
城
痺
Ｂ
醒
官
茂
萌
躓
拍
盆
掘
C
随
審
惚
腔
潤
腐
帝
繍
賊
総
塵
瓶
阻
史
演
胃
跪
企
領
裾
嗜
煽
械
刃
即
犠
牲
是
耶
瞼
乏
遂
緊
耗
齢
承
弊
兆
劣
斉
陶
囚
司
頻
争
俗
綿
儚
ぴ
敢
疎
糧
箋
塔
脅
葦
韻
糸
縫
臥
蔦
堕
尖
援
忌
薙
亭
臨
棄
倦
委
喚
融
來
償
刹
那
清
魑
魍
魎
菜
蓮
寺
踪
紡
贄
緯
酔
怯
殻
尾
煤
枢
琳
衛
爪
陳
採
壇
刑
佐
誠
谷
磨
忙
穢
麻
0
Ｈ
曜
魚
皺
芸
蔓
悶
○
罰
淹
携
畜
零
纂
薔
薇
咳
典
潮
紳
唾
掻
豆
嗚
磁
滓
脂
遺
祈
慨
爽
就
涼
躊
躇
季
妻
掲
王
焚
旧
婚
柵
貨
晶
渋
貼
併
千
政
昏
舗
籠
北
隊
浪
漁
謎
辣
致
践
網
吊
萎
咀
嚼
厄
眉
乾
殴
旺
酸
慌
軸
痴
牽
羨
勉
益
蓄
河
錬
愉
凛
躯
邂
逅
些
袖
粒
垢
爛
繁
諸
宗
刊
喩
沌
乳
股
蠢
週
卒
捏
尚
惹
餓
瞰
修
訴
藤
詛
劇
江
傍
淀
島
懲
掬
吠
詭
〜
2
【
】
７
喫
狩
庇
慰
雷
馳
述
漫
睦
妥
Ｐ
啜
甲
悦
囁
弄
喘
ｎ
漠
謀
嶷
Ｖ
岸
瓦
礫
撤
勤
咄
嗟
紋
稀
邸
粗
衰
坂
桁
宇
党
宣
赦
乙
母
賤
奢
砲
悠
府
宛
偉
遜
挑
覧
哲
骸
烈
逝
堪
敬
檻
晃
H
v
w
勇
軟
占
騎
燥
M
肥
氷
戯
N
Ｃ
諾
桃
隷
競
脚
竿
揉
曹
鱗
毅
渦
黝
逢
躁
斬
旋
彷
彿
圏
漸
昂
閻
瀕
緻
荘
朗
抽
豊
禅
焉
蒐
灼
騙
紆
芽
憊
穫
塀
魄
剪
蛇
鼠
嫉
妬
箔
咎
n
W
召
熊
戟
覇
坏
茨
鎮
猛
恒
咥
畏
嵌
唐
嵐
紐
瞭
詞
遵
京
蒔
坤
跋
扈
葛
涅
槃
膜
哄
弓
芒
秩
序
綻
詫
甚
囮
据
泣
壮
栞
捗
奔
芻
鍬
簾
曰
肘
須
孕
唸
智
秋
鴉
郵
禿
董
偵
閥
継
襖
阿
賭
津
妨
蕎
麦
犬
凍
屁
芯
％
征
＿
朽
誂
倫
其
壱
6
遍
ｍ
ｙ
ｐ
ｃ
≪
≫
鋼
辻
褄
募
腋
桶
蝉
朦
ⅰ
棲
拒
緋
瀟
洒
纏
耽
狸
唆
＆
恍
餅
鞘
擁
讐
貌
鉛
喪
辱
腸
煮
沸
燦
煌
罵
徹
冴
薪
淑
稽
脛
轢
睨
籍
漆
豹
摘
擲
請
揮
陸
楕
軍
掟
蛮
討
蒸
披
貶
訂
綱
促
ぢ
需
瞑
Ｏ
Ｅ
槌
ヌ
迅
往
郎
貰
肺
溝
岐
軌
娯
剤
糖
繊
泳
閲
胆
撮
県
冒
釘
貪
遡
熾
B
享
氏
冬
懸
祖
暦
販
億
劫
弧
湛
禊
准
乖
患
啓
搬
愁
丹
汁
茎
船
擬
銘
版
廉
J
袈
裟
□
艶
醸
徳
肪
尿
泌
晦
捻
p
j
c
媚
誉
侍
狐
髷
炭
顧
硯
嗅
譲
噴
贖
冥
屠
陥
牢
勧
旨
彙
疾
摩
批
厭
噎
踊
刈
陪
廷
迂
ゥ
辟
貞
憲
葬
仄
粘
浅
蜜
康
涸
農
霞
棘
謡
繕
哭
蛾
繭
儘
卑
褪
枷
煩
蝕
